FVMmatrix/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        //solver          PCG;
        //preconditioner  DIC;
        solver          OutputSymMatrix;
        preconditioner  none;
        tolerance       1e-06;
        relTol          0;
    }

    U
    {
        //solver          PBiCG;
        //preconditioner  DILU;
        solver          OutputAsymMatrix;
        preconditioner  none;
        tolerance       1e-05;
        relTol          0;
    }
    pFinal
    {
        $p;
        tolerance 1e-06;
        relTol      0;
    }
}

PISO
{
    nCorrectors     1;
    nNonOrthogonalCorrectors 0;
    pRefCell        0;
    pRefValue       0;
}


// ************************************************************************* //
